// Задача 13: Напишите программу, которая выводит третью цифру заданного числа 
//или сообщает, что третьей цифры нет. Выполнить с помощью числовых операций 
//(целочисленное деление, остаток от деления).

// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

Console.Write("Введите число ");
int N = Convert.ToInt32(Console.ReadLine());
if (N > 100)
{
    string chislo = Convert.ToString(N);
    Console.WriteLine("Третья цифра слева это " + chislo[2]);
}
else
{
    Console.WriteLine("Третьей цифры нет!");
}
