// Задача 15: Напишите программу, которая принимает на вход цифру, 
//обозначающую день недели, и проверяет, является ли этот день выходным.

// 6 -> да
// 7 -> да
// 1 -> нет

Console.Write("Введите цифру дня недели от 1 до 7: ");
int a = Convert.ToInt32(Console.ReadLine());
if (a > 7)
{   
    Console.WriteLine("Нужно ввести цифру от 1 до 7!");
}
else
{
    if (a > 5)
    {
        Console.WriteLine(a + " это выходной!");
    }
    else
    {
        Console.WriteLine(a + " это будний день");
    }
}
